# GetFamilySymbolIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..GetFamilySymbolIds Method
Family Class See Also
---
Gets the ids of the FamilySymbols owned by this Family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ISet<ElementId> GetFamilySymbolIds()
```

Visual Basic
---
```text
Public Function GetFamilySymbolIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetFamilySymbolIds()
```

# ### Return Value
The ids of the FamilySymbols.
# See Also
Family Class
Autodesk.Revit.DB Namespace